Revit 2027 API
BuiltInFailures.IlluminationFailures.IESFileNotFoundWarning Property
 Estimated Illumination failed. IES file not found for lighting fixture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IESFileNotFoundWarning { get; }
Public Shared ReadOnly Property IESFileNotFoundWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IESFileNotFoundWarning {
	FailureDefinitionId^ get ();
}
static member IESFileNotFoundWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.IlluminationFailures Class
Autodesk.Revit.DB Namespace